examples/PreAddRequest_2020-09-11_17-13-58-0146.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://reference.e-government.gv.at/namespace/zustellung/dual_pa/20130121#" xmlns:ns2="http://reference.e-government.gv.at/namespace/zustellung/dual/20130121#" xmlns:ns3="http://reference.e-government.gv.at/namespace/persondata/20130121#" xmlns:ns4="http://reference.postserver.at/namespace/persondata/20170308#">
  <soapenv:Header/>
  <soapenv:Body>
    <ns1:DualDeliveryPreAddressingRequest version="1.0">
      <ns2:Sender>
        <ns2:SenderProfile version="1.0">TU_GRAZ</ns2:SenderProfile>
      </ns2:Sender>
      <ns1:Recipients>
        <ns1:Recipient>
          <ns2:RecipientID>A7BDB73B-B310-409A-AB6C-2B45F6818140</ns2:RecipientID>
          <ns2:Recipient>
            <ns2:RecipientData>
              <ns3:PhysicalPerson>
                <ns3:Name>
                  <ns3:GivenName>Max</ns3:GivenName>
                  <ns3:FamilyName>Mustermann</ns3:FamilyName>
                </ns3:Name>
                <ns3:DateOfBirth>1970-06-04</ns3:DateOfBirth>
              </ns3:PhysicalPerson>
            </ns2:RecipientData>
          </ns2:Recipient>
        </ns1:Recipient>
        <ns1:Recipient>
          <ns2:RecipientID>AAA7203E-2BD1-43CD-91DE-27005C821EE0</ns2:RecipientID>
          <ns2:Recipient>
            <ns2:RecipientData>
              <ns3:PhysicalPerson>
                <ns3:Name>
                  <ns3:GivenName>Max</ns3:GivenName>
                  <ns3:FamilyName>Mustermann</ns3:FamilyName>
                </ns3:Name>
                <ns3:DateOfBirth>1970-06-04</ns3:DateOfBirth>
              </ns3:PhysicalPerson>
            </ns2:RecipientData>
          </ns2:Recipient>
        </ns1:Recipient>
        <ns1:Recipient>
          <ns2:RecipientID>F0102814-FCC0-4A3C-ABF1-56085439E34A</ns2:RecipientID>
          <ns2:Recipient>
            <ns2:RecipientData>
              <ns3:PhysicalPerson>
                <ns3:Name>
                  <ns3:GivenName>Max</ns3:GivenName>
                  <ns3:FamilyName>Mustermann</ns3:FamilyName>
                </ns3:Name>
                <ns3:DateOfBirth>1970-06-04</ns3:DateOfBirth>
              </ns3:PhysicalPerson>
            </ns2:RecipientData>
          </ns2:Recipient>
        </ns1:Recipient>
      </ns1:Recipients>
      <ns1:MetaData>
        <ns2:AppDeliveryID>12399_AE_W_Rsa_1</ns2:AppDeliveryID>
        <ns2:AdditionalMetaData>
          <ns2:PropertyValueMetaDataSet>
            <ns2:Parameter>
              <ns2:Property>CampaignId</ns2:Property>
              <ns2:Value>DUMMY</ns2:Value>
            </ns2:Parameter>
          </ns2:PropertyValueMetaDataSet>
        </ns2:AdditionalMetaData>
        <ns2:TestCase>true</ns2:TestCase>
        <ns2:ProcessingProfile version="1.1">ZuseDD</ns2:ProcessingProfile>
        <ns2:Asynchronous>false</ns2:Asynchronous>
        <ns1:PreCreateSendings>true</ns1:PreCreateSendings>
      </ns1:MetaData>
      <ns2:DeliveryChannels/>
    </ns1:DualDeliveryPreAddressingRequest>
  </soapenv:Body>
</soapenv:Envelope>
